# Recommender Systems

# Библиотеки

In [1]:
from abc import ABC, abstractmethod
from typing import Dict, List

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import pickle
from implicit.als import AlternatingLeastSquares
from scipy.sparse import csr_matrix
from sklearn.preprocessing import LabelEncoder
from tqdm.auto import tqdm

# Данные

В качестве данных будем использовать датасет от Кино.Триколор.
Это информация о просмотрах пользователей различных фильмов и сериалов с названиями, описаниями и прочими фичами. 

**Обратите внимание, что вы можете парсить интернет, для получения дополнительных фичей! Только не забудьте описать, какие фичи вы взяли и где вы их достали!**   
Мы заранее поделили выборки на тренировочную и тестовую части, поэтому **просим** вас придерживаться следующих правил: с тренировочными данными разрешается делать **всё что угодно**, тестовую же часть **запрещается изменять**!  

Датасет представляет из себя 4 файла: тренировочную часть (`train_data.csv`), тестовую часть(`test_data.csv`), описание пользователей(`users_df.csv`) и описание айтемов(`items_df.csv`).

In [2]:
data_folder = ""

users_df = pd.read_csv(data_folder + "users_df.csv")
items_df = pd.read_csv(data_folder + "items_df.csv")

countries = pd.read_csv(data_folder + "countries.csv")
genres = pd.read_csv(data_folder + "genres.csv")
staff = pd.read_csv(data_folder + "staff.csv")

train_part = pd.read_csv(data_folder + "train_data.csv", parse_dates=["datetime"])
test_part = pd.read_csv(data_folder + "test_data.csv")
test_part = test_part.groupby("user_id").agg({"movie_id": list}).reset_index()

# Пользователи

In [3]:
users_df.head(10)

   user_id age_category   income      sex  kids_flg        education
0    10250        35-44      NaN      NaN       0.0           Высшее
1     2062        18-24      NaN  Женский       0.0          Среднее
2    12980        35-44      NaN  Женский       1.0  Неполное высшее
3    30646        35-44   низкий      NaN       1.0           Высшее
4    43069        25-34      NaN  Женский       NaN           Высшее
5    46037        25-34   низкий  Мужской       0.0          Среднее
6    15060        18-24  средний  Мужской       0.0  Без образования
7    38702          NaN  высокий  Мужской       0.0              NaN
8     2019        25-34   низкий  Женский       NaN              NaN
9    34480        25-34   низкий  Женский       1.0           Высшее

## Какие есть признаки?

1. `user_id` – индентификатор пользователя, уникален для каждого
2. `age_category` – категориальный признак, показывающий возрастную группу пользователя
3. `income` – категориальный признак, показывающий зарплатную группу пользователя
4. `sex` – пол пользователя
5. `kids_flg` – наличие детей у пользователя
6. `education` – уровень образования пользователя

# Айтемы

In [4]:
items_df.head(4)

,id,title,year,date_publication,description,genres,countries,staff,title_orig,age_rating,keywords
0,0,"Мама, я дома",2022-01-01,2022-11-23T00:00:00,Где-то в глубинке вместе с дочерью и внуком жи...,[97],[238],"[1883, 33655, 25890, 1001, 12051, 10110, 16895]",NaN,NaN,NaN
1,1,Три метра над уровнем неба,2010-01-01,NaN,"История любви парня и девушки, принадлежащих к...","[138, 97, 294]",[242],"[18168, 23444, 10850, 21847, 30555, 24469, 268...",Tres metros sobre el cielo,16.0,"Три, метра, над, уровнем, неба, 2010, Испания,..."
2,2,Детектив ди и тайна призрачного пламени,2010-01-01,NaN,"690 год нашей эры, Китай. Первая императрица д...","[294, 302]","[250, 117]","[3933, 19953, 32174, 30640, 14127, 32141, 2549...",NaN,NaN,NaN
3,3,Капитан,2017-01-01,2022-10-20T00:00:00,Вторая мировая война подходит к концу. В это в...,"[97, 303, 143, 319]","[188, 212, 0]","[16006, 12217, 30668, 28806, 16172, 5045, 1663...",NaN,NaN,NaN

## Какие есть признаки?

1. `id` – индентификатор айтема, уникален для каждого
2. `title` – Название на русском языке
3. `year` – Дата выхода
4. `date_publication` – дата публикации на платформе
5. `description` – описание (на русском)
6. `genres` - список жанров (представлен строкой)
7. `countries` – страна издания
8. `staff` – режиссер(ы), актёры
9. `title_orig` – название на английском
10. `age_rating` – возрастной рейтинг картины
11. `keywords` – ключевые слова, описывающие картину

# Страны выпуска фильмов

In [5]:
countries.head()

   id            name
0   0         Франция
1   1          Мальта
2   5  Новая Зеландия
3   8            Куба
4  10     Пуэрто-Рико

# Жанры

In [6]:
genres.head()

   id                  name
0   2                Сказка
1   8              Здоровье
2  17                 Наука
3  24  Комедийная мелодрама
4  38               Мистика

# Актеры, режиcсеры

In [7]:
staff.head(2)

   id           name   role
0   0  Юрий Волынцев  actor
1   1    Коннор Смит  actor

# Просмотры пользователей

### Тренировачные данные

In [8]:
print(f"Число тренировачных интеракций: {len(train_part):,}")
train_part.head()

Число тренировачных интеракций: 1,251,871

   id                          datetime  user_id  movie_id  duration  is_train
0   0  2023-04-06 15:00:00.071114+03:00    10250     427.0     485.0      True
1   1  2023-04-06 15:00:01.123928+03:00     2062    1521.0     129.0      True
2   2  2023-04-06 15:00:03.957246+03:00    12980    4598.0    2795.0      True
3   3  2023-04-06 15:00:04.990565+03:00    30646    5324.0    5094.0      True
4   4  2023-04-06 15:00:10.495017+03:00    43069    4291.0      75.0      True

### Тестовые данные

In [9]:
print(f"Число тестовых пользователей: {len(test_part):,}")
test_part.head()

Число тестовых пользователей: 66,900

   user_id                                           movie_id
0        0  [12.0, 6201.0, 5542.0, 2025.0, 190.0, 5358.0, ...
1        1  [2515.0, 1540.0, 5210.0, 1608.0, 3590.0, 7215....
2        2  [5998.0, 190.0, 7327.0, 947.0, 3814.0, 876.0, ...
3        3  [4812.0, 3935.0, 802.0, 4459.0, 4340.0, 5975.0...
4        4  [152.0, 195.0, 800.0, 2266.0, 6634.0, 7412.0, ...

### Обратите внимание, что формат данных тестовой и тренировочной частей отличается. 
#### Это сделано для того, чтобы вы могли использовать дополнительную информацию в своих моделях, например такую как время просмотра (`duration`), а так же дату последнего просмотра (`datetime`)
#### При этом на тестовых данных такой информации нет, так как мы не можем смотреть в будущее.     

#### Тестовые данные также приведены в удобный для подсчета метрик вид.

# Так что же нужно сделать?

### tl;dr – красивые визуализации и креативные подходы

**Мы не ставим перед вами задачу обучить модель на тестовой выборке** (хотя вы можете это сделать), задание скорее в том, чтобы поискать инсайты в данных и поиграться с ними.

Если говорить более формально, то мы будем оценивать EDA (Exploration Data Analysis) данных, с которыми вы работаете и гипотезы, которые вы предложите проверить на его основе.

## Помните:
1. Нет правильного способа решить задачу. Не стоит беспокоиться, что вы делаете что-то неправильно. Мы хотим увидеть творческий подход и ваши способности к исследованию и прототипированию, а не какое-то конкретное решение задачи.
3. Вы можете использовать любые библиотеки и фреймворки, которые вам могут быть необходимы.
4. Сфокусируйтесь на том, чтобы код были чистый и понятный. Если вы считаете, что какая-то его часть может быть непонятна, то добавьте комментарии. Мы очень сильно ценим хорошо написанный код и выводы, поэтому если решение задачи будет оформлено грязно, то мы можем отклонить заявку.

## Результат
Мы ожидаем увидеть один (EDA) ноутбук на вашем [GitHub](https://github.com/) или ссылками на ваш [Google Colab](https://colab.research.google.com/?hl=ru).

## Дополнительно
Если вам будет интересно, вы можете обучить модель предсказания следующего фильма.

   ##### Подходы, которые можно попробовать:
   * статистически подходы, основанные на вашем анализе данных
   * классические метрические методы, вроде knn, а как посчитать вектора пользователей – пусть уже ваша фантазия вам диктует. Здесь вам помогут item-based модели, вроде EASE или SLIM
   * затюненный или модифицированный ALS (ну или любая другая модель матричной факторизации)
   * классические модели вроде градиентных бустингов (catboost, lightGBM) тоже работают в таких задачах (вам ведь ничего не мешает учить классификатор на просмотренный и непросмотренный фильмы, правда? осталось только насэмплить вторых)
   *  DL подходы, например [DSSM](https://kishorepv.github.io/DSSM/), [NCF](https://towardsdatascience.com/neural-collaborative-filtering-96cef1009401), [Bert4Rec](https://towardsdatascience.com/build-your-own-movie-recommender-system-using-bert4rec-92e4e34938c5) или [любой другой алгоритм](https://habr.com/ru/companies/prequel/articles/573880/), который вы найдете, например графовые или дифузионные подходы, почему нет)